; domain
(define (domain truck-domain)
    
    (:requirements :strips)
    
    (:predicates 
        (LOCATION ?l)(CONTAINER ?c)(TRUCK ?t)
        (large ?c)(small ?c);container size
        (tr-loc ?t ?l)(cont-loc ?c ?l);truck and container locations
        (goal-loc ?l);location 5
        (load_large ?t);free for 40 ft container
        (loaded_large ?t ?c);filled with 40 ft container
        
        (load_left ?t)(load_right ?t);free for 20 ft containers
        (loaded_left ?t ?c)(loaded_right ?t ?c);filled with 20 ft containers
        (placed ?c ?l);container is in the goal location
        
    )
    
    
    (:action load_small_1; load first 20 ft object to the 2. truck
        :parameters(?t ?c ?l)
        :precondition(and (CONTAINER ?c)(small ?c);small container is chosen
                        (load_left ?t);left side of the 2. truck is free
                        (LOCATION ?l)
                        (tr-loc ?t ?l)(cont-loc ?c ?l);cont and truck are at the same location
        )
        :effect(and (loaded_left ?t ?c);left side is filled
                    (not (cont-loc ?c ?l));container is not in the location
                    (not (load_left ?t));left side of the truck is not free
        )
    )
    
    (:action load_small_2; load second 20 ft object to the 2. truck
        :parameters(?t ?c1 ?c2 ?l)
        :precondition(and (load_right ?t);right side of the 2. truck is free
                        (LOCATION ?l)
                        (CONTAINER ?c2)(small ?c2);small container is chosen
                        (tr-loc ?t ?l)(cont-loc ?c2 ?l);cont and truck are at the same location
                        (loaded_left ?t ?c1);left side is filled
        )
        :effect(and (loaded_right ?t ?c2);right side is filled
                    (not (cont-loc ?c2 ?l));container is not in the location
                    (not (load_right ?t));right side of the truck is not free
        )
    )
    
    (:action unload_small;unload 2 20 ft containers
        :parameters(?l ?t ?c1 ?c2)
        :precondition(and (loaded_right ?t ?c1)(loaded_left ?t ?c2);both sides of the truck is filled
                        (goal-loc ?l)(tr-loc ?t ?l);truck is in the goal location
        )
        :effect(and (load_right ?t)(load_left ?t);both sides of the truck 2 are free
                    (placed ?c1 ?l)(placed ?c2 ?l);two containers are placed to the goal location
                    (not (loaded_left ?t ?c2));left side is not filled
                    (not (loaded_right ?t ?c1));right side is not filled
        )
    )
    
    (:action load_large ;truck_1 takes the 40 ft containers
        :parameters(?t ?c ?l)
        :precondition(and (CONTAINER ?c)(large ?c);large container is chosen
                        (LOCATION ?l)
                        (load_large ?t);truck 1 is free
                        (tr-loc ?t ?l)(cont-loc ?c ?l);cont and truck are at the same location
        )
        :effect(and (loaded_large ?t ?c);truck 1 is full
                    (not (cont-loc ?c ?l));container is not in the location
                    (not (load_large ?t));truck 1 is not free
        )
    )
    
    (:action unload_large ;truck 1 unloads the 40 ft containers
        :parameters(?t ?l ?c)
        :precondition(and (CONTAINER ?c)(large ?c);large container
                            (LOCATION ?l)
                            (loaded_large ?t ?c);truck 1 is full
                            (goal-loc ?l)(tr-loc ?t ?l);cont and truck are at the same location
        )
        :effect(and (load_large ?t);truck 1 is free
                    (placed ?c ?l);container is at the goal location
                    (not (loaded_large ?t ?c));truck 1 is not loaded
        )
    )
    
    (:action move ;to change trucks location
        :parameters(?from ?to ?t)
        :precondition(and (TRUCK ?t)(LOCATION ?from)(LOCATION ?to)
                        (tr-loc ?t ?from)
        )
        :effect(and (tr-loc ?t ?to)
                    (not (tr-loc ?t ?from))
        )
    )
    
    
)

; problem
(define (problem truck-problem)

    (:domain truck-domain)
    
    (:objects 
        truck_1 truck_2;trucks
        location_1 location_2 location_3 location_4 location_5;locations
        large_1 large_2;40 ft containers 
        small_1 small_2 small_3 small_4;20 ft containers
        left right;left side and right side of the truck that carries 20 ft containers
    )
    
    (:init 
        (TRUCK truck_1)(TRUCK truck_2)
        (load_large truck_1);truck 1 carries 40 ft container
        (load_left truck_2)(load_right truck_2);truck 2 carries 2 20 ft containers
        (LOCATION location_1)(LOCATION location_2)(LOCATION location_3)(LOCATION location_4)(LOCATION location_5)
        (CONTAINER large_1)(CONTAINER large_2)
        (CONTAINER small_1)(CONTAINER small_2)(CONTAINER small_3)(CONTAINER small_4)
        (large large_1)(large large_2);40 ft containers
        (small small_1)(small small_2)(small small_3)(small small_4);20 ft containers
        (tr-loc truck_1 location_4)(tr-loc truck_2 location_4);trucks at location_4
        ;container locations at the beginning
        (cont-loc large_1 location_1)(cont-loc large_2 location_1)
        (cont-loc small_1 location_1)(cont-loc small_2 location_2)(cont-loc small_3 location_3)(cont-loc small_4 location_4)
        ;goal location
        (goal-loc location_5)
    )
    
    (:goal ;all containers should be placed in location_5
        (and (placed large_1 location_5)(placed large_2 location_5)
        (placed small_1 location_5)(placed small_2 location_5)(placed small_3 location_5)(placed small_4 location_5)
        )
    )
    
    
)

; plan
1. (move location_4 location_1 truck_2)
   deleted: (tr-loc truck_2 location_4)
   added: (tr-loc truck_2 location_1)
   goals met: 0 of 6
2. (move location_1 location_2 truck_2)
   deleted: (tr-loc truck_2 location_1)
   added: (tr-loc truck_2 location_2)
   goals met: 0 of 6
3. (load_small_1 truck_2 small_2 location_2)
   deleted: (cont-loc small_2 location_2) (load_left truck_2)
   added: (loaded_left truck_2 small_2)
   goals met: 0 of 6
4. (move location_2 location_3 truck_2)
   deleted: (tr-loc truck_2 location_2)
   added: (tr-loc truck_2 location_3)
   goals met: 0 of 6
5. (load_small_2 truck_2 small_2 small_3 location_3)
   deleted: (cont-loc small_3 location_3) (load_right truck_2)
   added: (loaded_right truck_2 small_3)
   goals met: 0 of 6
6. (move location_3 location_5 truck_2)
   deleted: (tr-loc truck_2 location_3)
   added: (tr-loc truck_2 location_5)
   goals met: 0 of 6
7. (unload_small location_5 truck_2 small_3 small_2)
   deleted: (loaded_left truck_2 small_2) (loaded_right truck_2 small_3)
   added: (load_right truck_2) (load_left truck_2) (placed small_3 location_5) (placed small_2 location_5)
   goals met: 2 of 6
8. (move location_4 location_1 truck_1)
   deleted: (tr-loc truck_1 location_4)
   added: (tr-loc truck_1 location_1)
   goals met: 2 of 6
9. (load_large truck_1 large_2 location_1)
   deleted: (cont-loc large_2 location_1) (load_large truck_1)
   added: (loaded_large truck_1 large_2)
   goals met: 2 of 6
10. (move location_1 location_5 truck_1)
   deleted: (tr-loc truck_1 location_1)
   added: (tr-loc truck_1 location_5)
   goals met: 2 of 6
11. (unload_large truck_1 location_5 large_2)
   deleted: (loaded_large truck_1 large_2)
   added: (load_large truck_1) (placed large_2 location_5)
   goals met: 3 of 6
12. (move location_5 location_1 truck_2)
   deleted: (tr-loc truck_2 location_5)
   added: (tr-loc truck_2 location_1)
   goals met: 3 of 6
13. (move location_5 location_1 truck_1)
   deleted: (tr-loc truck_1 location_5)
   added: (tr-loc truck_1 location_1)
   goals met: 3 of 6
14. (load_large truck_1 large_1 location_1)
   deleted: (cont-loc large_1 location_1) (load_large truck_1)
   added: (loaded_large truck_1 large_1)
   goals met: 3 of 6
15. (load_small_1 truck_2 small_1 location_1)
   deleted: (cont-loc small_1 location_1) (load_left truck_2)
   added: (loaded_left truck_2 small_1)
   goals met: 3 of 6
16. (move location_1 location_4 truck_2)
   deleted: (tr-loc truck_2 location_1)
   added: (tr-loc truck_2 location_4)
   goals met: 3 of 6
17. (move location_1 location_5 truck_1)
   deleted: (tr-loc truck_1 location_1)
   added: (tr-loc truck_1 location_5)
   goals met: 3 of 6
18. (unload_large truck_1 location_5 large_1)
   deleted: (loaded_large truck_1 large_1)
   added: (load_large truck_1) (placed large_1 location_5)
   goals met: 4 of 6
19. (load_small_2 truck_2 small_1 small_4 location_4)
   deleted: (cont-loc small_4 location_4) (load_right truck_2)
   added: (loaded_right truck_2 small_4)
   goals met: 4 of 6
20. (move location_4 location_5 truck_2)
   deleted: (tr-loc truck_2 location_4)
   added: (tr-loc truck_2 location_5)
   goals met: 4 of 6
21. (unload_small location_5 truck_2 small_4 small_1)
   deleted: (loaded_left truck_2 small_1) (loaded_right truck_2 small_4)
   added: (load_right truck_2) (load_left truck_2) (placed small_4 location_5) (placed small_1 location_5)
   goals met: 6 of 6
